{
    "success": true,
    "data": {
        "title": "When You Don’t Get to Say Goodbye",
        "content": "<img src='https://miro.medium.com/max/1400/1*D7585qfgzor8hTFe2ox1Kg.jpeg'></img><p>My husband’s paternal grandmother, fondly known as Mamaw, passed away on April 22,2020 after a lengthy battle with Alzheimer’s disease. Her death, while not unexpected, came at a uniquely inopportune time: right smack in the middle of the COVID-19 pandemic.</p><p>My husband received a call in early February informing him that the nursing home in which his grandmother resided would be closing to visitors due to the coronavirus. We had no clue at that time how things would progress, worldwide, nationally, or on our deeply personal level. I remember thinking that losing contact with her husband who visited her regularly would probably cause another cognitive decline. Before I had a chance to worry about it too much, the world descended into disarray, schools were canceled, I was furloughed, and then the phone rang again.</p><p>ALZ is a slow killer. As they near death, the normal hunger and thirst cues don’t fire. Mamaw’s nursing home alerted us as soon as this happened, coupled with her sudden lack of response. My husband and his grandfather were allowed to enter the nursing home, with masks. Three days later, she was gone.</p><p>We were in the car to come say our goodbyes when the phone rang. Again, they had called as her breathing changed earlier that day. We didn’t make it. I will be forever grateful that the staff let us come in, again with masks, and whisper our goodbyes at her bedside. She was still warm, looked like maybe she was still asleep. I wondered if they got it wrong. But she was gone. Her nails were painted so nicely; I felt so grateful for the care she had received.</p><p>That quiet goodbye at her bedside is all we will get as the country still reels from the current pandemic. I am heartbroken that we won’t get to experience the normal progression of funeral rites. However you feel about funeral home proceedings, I like hearing the stories of those whom I love from those who loved them as well. I like reading the cards on flowers. I like the process, the way it allows a human being to begin the lifelong process of living life without.</p><p>When my father-in-law died by suicide in 2018, Mamaw couldn’t understand. Her descent into ALZ began the summer before, though probably years and years prior knowing her health history and that of both her sister and mother, when she fell during the summer of 2017. By September 2018, in the wake of the sudden and tragic loss of her son, she came back to us for a few days. Or, if you’ve ever provided care for anyone with ALZ or a form of dementia, you will understand when I say that she had a few good days, cued conversations well, and participated in the services to the best of her ability.</p>"
    }
}